muli25946/STM32F407VET6-FC-System/bsp/Src/oled.c
#include "oled.h"
#include "stm32f4xx_hal_def.h"
#include "stm32f4xx_hal_i2c.h"
#include <math.h>
#include <stdarg.h>
#include <stdio.h>
#include <string.h>

/**
 * OLED显存数组
 */
uint8_t OLED_DisplayBuf[8][128];

/**
 * 函    数：OLED写命令
 * 参    数：Command 要写入的命令值，范围：0x00~0xFF
 * 返 回 值：无
 */
void OLED_WriteCommand(uint8_t Command) {
  HAL_I2C_Mem_Write(&OLED_IIC, OLED_ADDR, OLED_WRITE_MODE, I2C_MEMADD_SIZE_8BIT,
                    &Command, 1, 10);
}

/**
 * 函    数：OLED写数据
 * 参    数：Data 要写入数据的起始地址
 * 参    数：Count 要写入数据的数量
 * 返 回 值：无
 */
void OLED_WriteData(uint8_t *Data, uint8_t Count) {
  HAL_I2C_Mem_Write(&OLED_IIC, OLED_ADDR, OLED_WRITE_DATA,
                        I2C_MEMADD_SIZE_8BIT, Data, Count,10);
}

/**
 * 函    数：OLED初始化
 * 参    数：无
 * 返 回 值：无
 * 说    明：使用前，需要调用此初始化函数
 */
void OLED_Init(void) {
  uint8_t data[23] = {0xAE, 0xD5, 0x80, 0xA8, 0x3F, 0xD3, 0x00, 0x40,
                      0xA1, 0xC8, 0xDA, 0x12, 0x81, 0xCF, 0xD9, 0xF1,
                      0xDB, 0xDB, 0xA4, 0xA6, 0x8D, 0x14, 0xAF};
  /*写入一系列的命令，对OLED进行初始化配置*/
  HAL_I2C_Mem_Write(&OLED_IIC, OLED_ADDR, OLED_WRITE_MODE, I2C_MEMADD_SIZE_8BIT,
                    data, sizeof(data), HAL_MAX_DELAY);

  OLED_Clear();  // 清空显存数组
  OLED_Update(); // 更新显示，清屏，防止初始化后未显示内容时花屏
}

/**
 * 函    数：OLED设置显示光标位置
 * 参    数：Page 指定光标所在的页，范围：0~7
 * 参    数：X 指定光标所在的X轴坐标，范围：0~127
 * 返 回 值：无
 * 说    明：OLED默认的Y轴，只能8个Bit为一组写入，即1页等于8个Y轴坐标
 */
void OLED_SetCursor(uint8_t Page, uint8_t X) {
  /*如果使用此程序驱动1.3寸的OLED显示屏，则需要解除此注释*/
  /*因为1.3寸的OLED驱动芯片（SH1106）有132列*/
  /*屏幕的起始列接在了第2列，而不是第0列*/
  /*所以需要将X加2，才能正常显示*/
  X += 2;

  /*通过指令设置页地址和列地址*/
  OLED_WriteCommand(0xB0 | Page);              // 设置页位置
  OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4)); // 设置X位置高4位
  OLED_WriteCommand(0x00 | (X & 0x0F));        // 设置X位置低4位
}

/*********************硬件配置*/

/*工具函数*********************/

/*工具函数仅供内部部分函数使用*/

/**
 * 函    数：次方函数
 * 参    数：X 底数
 * 参    数：Y 指数
 * 返 回 值：等于X的Y次方
 */
uint32_t OLED_Pow(uint32_t X, uint32_t Y) {
  uint32_t Result = 1; // 结果默认为1
  while (Y--)          // 累乘Y次
  {
    Result *= X; // 每次把X累乘到结果上
  }
  return Result;
}

/**
 * 函    数：判断指定点是否在指定多边形内部
 * 参    数：nvert 多边形的顶点数
 * 参    数：vertx verty 包含多边形顶点的x和y坐标的数组
 * 参    数：testx testy 测试点的X和y坐标
 * 返 回 值：指定点是否在指定多边形内部，1：在内部，0：不在内部
 */
uint8_t OLED_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty,
                    int16_t testx, int16_t testy) {
  int16_t i, j, c = 0;

  /*此算法由W. Randolph Franklin提出*/
  /*参考链接：https://wrfranklin.org/Research/Short_Notes/pnpoly.html*/
  for (i = 0, j = nvert - 1; i < nvert; j = i++) {
    if (((verty[i] > testy) != (verty[j] > testy)) &&
        (testx <
         (vertx[j] - vertx[i]) * (testy - verty[i]) / (verty[j] - verty[i]) +
             vertx[i])) {
      c = !c;
    }
  }
  return c;
}

/**
 * 函    数：判断指定点是否在指定角度内部
 * 参    数：X Y 指定点的坐标
 * 参    数：StartAngle EndAngle 起始角度和终止角度，范围：-180~180
 *           水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * 返 回 值：指定点是否在指定角度内部，1：在内部，0：不在内部
 */
uint8_t OLED_IsInAngle(int16_t X, int16_t Y, int16_t StartAngle,
                       int16_t EndAngle) {
  int16_t PointAngle;
  PointAngle = atan2(Y, X) / 3.14 * 180; // 计算指定点的弧度，并转换为角度表示
  if (StartAngle < EndAngle)             // 起始角度小于终止角度的情况
  {
    /*如果指定角度在起始终止角度之间，则判定指定点在指定角度*/
    if (PointAngle >= StartAngle && PointAngle <= EndAngle) {
      return 1;
    }
  } else // 起始角度大于于终止角度的情况
  {
    /*如果指定角度大于起始角度或者小于终止角度，则判定指定点在指定角度*/
    if (PointAngle >= StartAngle || PointAngle <= EndAngle) {
      return 1;
    }
  }
  return 0; // 不满足以上条件，则判断判定指定点不在指定角度
}

/*********************工具函数*/

/*功能函数*********************/

/**
 * 函    数：将OLED显存数组更新到OLED屏幕
 * 参    数：无
 * 返 回 值：无
 * 说    明：所有的显示函数，都只是对OLED显存数组进行读写
 *           随后调用OLED_Update函数或OLED_UpdateArea函数
 *           才会将显存数组的数据发送到OLED硬件，进行显示
 *           故调用显示函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_Update(void) {
  uint8_t j;
  /*遍历每一页*/
  for (j = 0; j < 8; j++) {
    /*设置光标位置为每一页的第一列*/
    OLED_SetCursor(j, 0);
    /*连续写入128个数据，将显存数组的数据写入到OLED硬件*/
    OLED_WriteData(OLED_DisplayBuf[j], 128);
  }
}

/**
 * 函    数：将OLED显存数组部分更新到OLED屏幕
 * 参    数：X 指定区域左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * 参    数：Y 指定区域左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * 参    数：Width 指定区域的宽度，范围：0~128
 * 参    数：Height 指定区域的高度，范围：0~64
 * 返 回 值：无
 * 说    明：此函数会至少更新参数指定的区域
 *           如果更新区域Y轴只包含部分页，则同一页的剩余部分会跟随一起更新
 * 说    明：所有的显示函数，都只是对OLED显存数组进行读写
 *           随后调用OLED_Update函数或OLED_UpdateArea函数
 *           才会将显存数组的数据发送到OLED硬件，进行显示
 *           故调用显示函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_UpdateArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height) {
  int16_t j;
  int16_t Page, Page1;

  /*负数坐标在计算页地址时需要加一个偏移*/
  /*(Y + Height - 1) / 8 + 1的目的是(Y + Height) / 8并向上取整*/
  Page = Y / 8;
  Page1 = (Y + Height - 1) / 8 + 1;
  if (Y < 0) {
    Page -= 1;
    Page1 -= 1;
  }

  /*遍历指定区域涉及的相关页*/
  for (j = Page; j < Page1; j++) {
    if (X >= 0 && X <= 127 && j >= 0 && j <= 7) // 超出屏幕的内容不显示
    {
      /*设置光标位置为相关页的指定列*/
      OLED_SetCursor(j, X);
      /*连续写入Width个数据，将显存数组的数据写入到OLED硬件*/
      OLED_WriteData(&OLED_DisplayBuf[j][X], Width);
    }
  }
}

/**
 * 函    数：将OLED显存数组全部清零
 * 参    数：无
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_Clear(void) {
  uint8_t i, j;
  for (j = 0; j < 8; j++) // 遍历8页
  {
    for (i = 0; i < 128; i++) // 遍历128列
    {
      OLED_DisplayBuf[j][i] = 0x00; // 将显存数组数据全部清零
    }
  }
}

/**
 * 函    数：将OLED显存数组部分清零
 * 参    数：X 指定区域左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * 参    数：Y 指定区域左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * 参    数：Width 指定区域的宽度，范围：0~128
 * 参    数：Height 指定区域的高度，范围：0~64
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ClearArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height) {
  int16_t i, j;

  for (j = Y; j < Y + Height; j++) // 遍历指定页
  {
    for (i = X; i < X + Width; i++) // 遍历指定列
    {
      if (i >= 0 && i <= 127 && j >= 0 && j <= 63) // 超出屏幕的内容不显示
      {
        OLED_DisplayBuf[j / 8][i] &=
            ~(0x01 << (j % 8)); // 将显存数组指定数据清零
      }
    }
  }
}

/**
 * 函    数：将OLED显存数组全部取反
 * 参    数：无
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_Reverse(void) {
  uint8_t i, j;
  for (j = 0; j < 8; j++) // 遍历8页
  {
    for (i = 0; i < 128; i++) // 遍历128列
    {
      OLED_DisplayBuf[j][i] ^= 0xFF; // 将显存数组数据全部取反
    }
  }
}

/**
 * 函    数：将OLED显存数组部分取反
 * 参    数：X 指定区域左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * 参    数：Y 指定区域左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * 参    数：Width 指定区域的宽度，范围：0~128
 * 参    数：Height 指定区域的高度，范围：0~64
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ReverseArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height) {
  int16_t i, j;

  for (j = Y; j < Y + Height; j++) // 遍历指定页
  {
    for (i = X; i < X + Width; i++) // 遍历指定列
    {
      if (i >= 0 && i <= 127 && j >= 0 && j <= 63) // 超出屏幕的内容不显示
      {
        OLED_DisplayBuf[j / 8][i] ^= 0x01 << (j % 8); // 将显存数组指定数据取反
      }
    }
  }
}

/**
 * 函    数：OLED显示一个字符
 * 参    数：X 指定字符左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * 参    数：Y 指定字符左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * 参    数：Char 指定要显示的字符，范围：ASCII码可见字符
 * 参    数：FontSize 指定字体大小
 *           范围：OLED_8X16		宽8像素，高16像素
 *                 OLED_6X8		宽6像素，高8像素
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowChar(int16_t X, int16_t Y, char Char, uint8_t FontSize) {
  if (FontSize == OLED_8X16) // 字体为宽8像素，高16像素
  {
    /*将ASCII字模库OLED_F8x16的指定数据以8*16的图像格式显示*/
    OLED_ShowImage(X, Y, 8, 16, OLED_F8x16[Char - ' ']);
  } else if (FontSize == OLED_6X8) // 字体为宽6像素，高8像素
  {
    /*将ASCII字模库OLED_F6x8的指定数据以6*8的图像格式显示*/
    OLED_ShowImage(X, Y, 6, 8, OLED_F6x8[Char - ' ']);
  }
}

/**
 * 函    数：OLED显示字符串
 * 参    数：X 指定字符串左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * 参    数：Y 指定字符串左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * 参    数：String 指定要显示的字符串，范围：ASCII码可见字符组成的字符串
 * 参    数：FontSize 指定字体大小
 *           范围：OLED_8X16		宽8像素，高16像素
 *                 OLED_6X8		宽6像素，高8像素
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowString(int16_t X, int16_t Y, char *String, uint8_t FontSize) {
  uint8_t i;
  for (i = 0; String[i] != '\0'; i++) // 遍历字符串的每个字符
  {
    /*调用OLED_ShowChar函数，依次显示每个字符*/
    OLED_ShowChar(X + i * FontSize, Y, String[i], FontSize);
  }
}

/**
 * 函    数：OLED显示数字（十进制，正整数）
 * 参    数：X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * 参    数：Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * 参    数：Number 指定要显示的数字，范围：0~4294967295
 * 参    数：Length 指定数字的长度，范围：0~10
 * 参    数：FontSize 指定字体大小
 *           范围：OLED_8X16		宽8像素，高16像素
 *                 OLED_6X8		宽6像素，高8像素
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length,
                  uint8_t FontSize) {
  uint8_t i;
  for (i = 0; i < Length; i++) // 遍历数字的每一位
  {
    /*调用OLED_ShowChar函数，依次显示每个数字*/
    /*Number / OLED_Pow(10, Length - i - 1) % 10 可以十进制提取数字的每一位*/
    /*+ '0' 可将数字转换为字符格式*/
    OLED_ShowChar(X + i * FontSize, Y,
                  Number / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
  }
}

/**
 * 函    数：OLED显示有符号数字（十进制，整数）
 * 参    数：X 指定数字左上角的横坐标，范围：-32768~32767，屏幕区域：0~127
 * 参    数：Y 指定数字左上角的纵坐标，范围：-32768~32767，屏幕区域：0~63
 * 参    数：Number 指定要显示的数字，范围：-2147483648~2147483647
 * 参    数：Length 指定数字的长度，范围：0~10
 * 参    数：FontSize 指定字体大小
 *           范围：OLED_8X16		宽8像素，高16像素
 *                 OLED_6X8		宽6像素，高8像素
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_ShowSignedNum(int16_t X, int16_t Y, int32_t Number, uint8_t Length,
                        uint8_t FontSize) {
  uint8_t i;
  uint32_t Number1;

