muli25946/STM32F407VET6-FC-System/bsp/Src/oled.c
    if (IsFilled) // 指定圆填充
    {
      /*遍历中间部分*/
      for (j = -y; j < y; j++) {
        /*在指定区域画点，填充部分圆*/
        OLED_DrawPoint(X + x, Y + j);
        OLED_DrawPoint(X - x, Y + j);
      }

      /*遍历两侧部分*/
      for (j = -x; j < x; j++) {
        /*在指定区域画点，填充部分圆*/
        OLED_DrawPoint(X - y, Y + j);
        OLED_DrawPoint(X + y, Y + j);
      }
    }
  }
}

/**
 * 函    数：OLED画椭圆
 * 参    数：X 指定椭圆的圆心横坐标，范围：-32768~32767，屏幕区域：0~127
 * 参    数：Y 指定椭圆的圆心纵坐标，范围：-32768~32767，屏幕区域：0~63
 * 参    数：A 指定椭圆的横向半轴长度，范围：0~255
 * 参    数：B 指定椭圆的纵向半轴长度，范围：0~255
 * 参    数：IsFilled 指定椭圆是否填充
 *           范围：OLED_UNFILLED		不填充
 *                 OLED_FILLED			填充
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_DrawEllipse(int16_t X, int16_t Y, uint8_t A, uint8_t B,
                      uint8_t IsFilled) {
  int16_t x, y, j;
  int16_t a = A, b = B;
  float d1, d2;

  /*使用Bresenham算法画椭圆，可以避免部分耗时的浮点运算，效率更高*/
  /*参考链接：https://blog.csdn.net/myf_666/article/details/128167392*/

  x = 0;
  y = b;
  d1 = b * b + a * a * (-b + 0.5);

  if (IsFilled) // 指定椭圆填充
  {
    /*遍历起始点Y坐标*/
    for (j = -y; j < y; j++) {
      /*在指定区域画点，填充部分椭圆*/
      OLED_DrawPoint(X, Y + j);
      OLED_DrawPoint(X, Y + j);
    }
  }

  /*画椭圆弧的起始点*/
  OLED_DrawPoint(X + x, Y + y);
  OLED_DrawPoint(X - x, Y - y);
  OLED_DrawPoint(X - x, Y + y);
  OLED_DrawPoint(X + x, Y - y);

  /*画椭圆中间部分*/
  while (b * b * (x + 1) < a * a * (y - 0.5)) {
    if (d1 <= 0) // 下一个点在当前点东方
    {
      d1 += b * b * (2 * x + 3);
    } else // 下一个点在当前点东南方
    {
      d1 += b * b * (2 * x + 3) + a * a * (-2 * y + 2);
      y--;
    }
    x++;

    if (IsFilled) // 指定椭圆填充
    {
      /*遍历中间部分*/
      for (j = -y; j < y; j++) {
        /*在指定区域画点，填充部分椭圆*/
        OLED_DrawPoint(X + x, Y + j);
        OLED_DrawPoint(X - x, Y + j);
      }
    }

    /*画椭圆中间部分圆弧*/
    OLED_DrawPoint(X + x, Y + y);
    OLED_DrawPoint(X - x, Y - y);
    OLED_DrawPoint(X - x, Y + y);
    OLED_DrawPoint(X + x, Y - y);
  }

  /*画椭圆两侧部分*/
  d2 =
      b * b * (x + 0.5) * (x + 0.5) + a * a * (y - 1) * (y - 1) - a * a * b * b;

  while (y > 0) {
    if (d2 <= 0) // 下一个点在当前点东方
    {
      d2 += b * b * (2 * x + 2) + a * a * (-2 * y + 3);
      x++;

    } else // 下一个点在当前点东南方
    {
      d2 += a * a * (-2 * y + 3);
    }
    y--;

    if (IsFilled) // 指定椭圆填充
    {
      /*遍历两侧部分*/
      for (j = -y; j < y; j++) {
        /*在指定区域画点，填充部分椭圆*/
        OLED_DrawPoint(X + x, Y + j);
        OLED_DrawPoint(X - x, Y + j);
      }
    }

    /*画椭圆两侧部分圆弧*/
    OLED_DrawPoint(X + x, Y + y);
    OLED_DrawPoint(X - x, Y - y);
    OLED_DrawPoint(X - x, Y + y);
    OLED_DrawPoint(X + x, Y - y);
  }
}

/**
 * 函    数：OLED画圆弧
 * 参    数：X 指定圆弧的圆心横坐标，范围：-32768~32767，屏幕区域：0~127
 * 参    数：Y 指定圆弧的圆心纵坐标，范围：-32768~32767，屏幕区域：0~63
 * 参    数：Radius 指定圆弧的半径，范围：0~255
 * 参    数：StartAngle 指定圆弧的起始角度，范围：-180~180
 *           水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * 参    数：EndAngle 指定圆弧的终止角度，范围：-180~180
 *           水平向右为0度，水平向左为180度或-180度，下方为正数，上方为负数，顺时针旋转
 * 参    数：IsFilled 指定圆弧是否填充，填充后为扇形
 *           范围：OLED_UNFILLED		不填充
 *                 OLED_FILLED			填充
 * 返 回 值：无
 * 说    明：调用此函数后，要想真正地呈现在屏幕上，还需调用更新函数
 */
void OLED_DrawArc(int16_t X, int16_t Y, uint8_t Radius, int16_t StartAngle,
                  int16_t EndAngle, uint8_t IsFilled) {
  int16_t x, y, d, j;

  /*此函数借用Bresenham算法画圆的方法*/

  d = 1 - Radius;
  x = 0;
  y = Radius;

  /*在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
  if (OLED_IsInAngle(x, y, StartAngle, EndAngle)) {
    OLED_DrawPoint(X + x, Y + y);
  }
  if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {
    OLED_DrawPoint(X - x, Y - y);
  }
  if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {
    OLED_DrawPoint(X + y, Y + x);
  }
  if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {
    OLED_DrawPoint(X - y, Y - x);
  }

  if (IsFilled) // 指定圆弧填充
  {
    /*遍历起始点Y坐标*/
    for (j = -y; j < y; j++) {
      /*在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
      if (OLED_IsInAngle(0, j, StartAngle, EndAngle)) {
        OLED_DrawPoint(X, Y + j);
      }
    }
  }

  while (x < y) // 遍历X轴的每个点
  {
    x++;
    if (d < 0) // 下一个点在当前点东方
    {
      d += 2 * x + 1;
    } else // 下一个点在当前点东南方
    {
      y--;
      d += 2 * (x - y) + 1;
    }

    /*在画圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
    if (OLED_IsInAngle(x, y, StartAngle, EndAngle)) {
      OLED_DrawPoint(X + x, Y + y);
    }
    if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {
      OLED_DrawPoint(X + y, Y + x);
    }
    if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {
      OLED_DrawPoint(X - x, Y - y);
    }
    if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {
      OLED_DrawPoint(X - y, Y - x);
    }
    if (OLED_IsInAngle(x, -y, StartAngle, EndAngle)) {
      OLED_DrawPoint(X + x, Y - y);
    }
    if (OLED_IsInAngle(y, -x, StartAngle, EndAngle)) {
      OLED_DrawPoint(X + y, Y - x);
    }
    if (OLED_IsInAngle(-x, y, StartAngle, EndAngle)) {
      OLED_DrawPoint(X - x, Y + y);
    }
    if (OLED_IsInAngle(-y, x, StartAngle, EndAngle)) {
      OLED_DrawPoint(X - y, Y + x);
    }

    if (IsFilled) // 指定圆弧填充
    {
      /*遍历中间部分*/
      for (j = -y; j < y; j++) {
        /*在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
        if (OLED_IsInAngle(x, j, StartAngle, EndAngle)) {
          OLED_DrawPoint(X + x, Y + j);
        }
        if (OLED_IsInAngle(-x, j, StartAngle, EndAngle)) {
          OLED_DrawPoint(X - x, Y + j);
        }
      }

      /*遍历两侧部分*/
      for (j = -x; j < x; j++) {
        /*在填充圆的每个点时，判断指定点是否在指定角度内，在，则画点，不在，则不做处理*/
        if (OLED_IsInAngle(-y, j, StartAngle, EndAngle)) {
          OLED_DrawPoint(X - y, Y + j);
        }
        if (OLED_IsInAngle(y, j, StartAngle, EndAngle)) {
          OLED_DrawPoint(X + y, Y + j);
        }
      }
    }
  }
}
